Revit 2024 API
PartUtils.GetSplittingCurves Method
Overload List
Name | Description
GetSplittingCurves(Document, ElementId)
 Identifies the curves that were used to create the part.
GetSplittingCurves(Document, ElementId, Plane)
 Identifies the curves that were used to create the part and the plane in which they reside.
See Also
PartUtils Class
PartUtils Members
Autodesk.Revit.DB Namespace